
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_access_key
* Replace
  * module.sptribs-frontend-session-storage.azurerm_private_endpoint.this[0]
  * module.sptribs-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://sptribs-aat.vault.azure.net/secrets/redis-access-key/cde2ca7c0e6f4def9affd2b3a5483dc1"
        name                    = "redis-access-key"
      ~ tags                    = {
          - "application"         = "special-tribunals"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#special-tribunals-dev-channel"
          - "environment"         = "staging"
          - "managedBy"           = "Special Tribunals"
          - "source"              = "redis sptribs-aat.redis.cache.windows.net"
        } -> (known after apply)
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.sptribs-frontend-session-storage.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-cache-aat/providers/Microsoft.Network/privateEndpoints/sptribs-aat" -> (known after apply)
        name                     = "sptribs-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-cache-aat/providers/Microsoft.Network/networkInterfaces/sptribs-aat.nic.2ef9ba97-6f61-4b2b-b19c-81211f2379cb"
              - name = "sptribs-aat.nic.2ef9ba97-6f61-4b2b-b19c-81211f2379cb"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-cache-aat/providers/Microsoft.Network/privateEndpoints/sptribs-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "sptribs-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.5",
                        ]
                      - name         = "sptribs-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "special-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-cache-aat/providers/Microsoft.Network/privateEndpoints/sptribs-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "sptribs-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-cache-aat/providers/Microsoft.Cache/Redis/sptribs-aat" -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.sptribs-frontend-session-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "sptribs-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-cache-aat/providers/Microsoft.Cache/Redis/sptribs-aat" -> (known after apply)
        name                          = "sptribs-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0.14" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "special-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":452,"Program":"tfcmt","SHA1":"","Vars":{}} -->